var Tip = {
    tips: [
        "規矩要嚴，執行要寬：「不以規矩，不能成方圓」，凡事要有規矩和準繩，但是如果事事以硬性定，反而失去人性裡的自動自發的可貴性，所謂「規矩行盡，禮貌必衰」。因此，在落實層面上，要嚴之有理、嚴之有愛、嚴之有度，嚴要嚴得適度、寛要寛得恰當、要寛嚴相濟，規矩才具有依循的可行性。",
        "禪門教育有一些很特殊的方式，譬如說，上等的根機，可以經得起棒喝；中等的根機，就是正常教導；下等的根機，你就是跟他禮遇也沒有用。因此，對於禪門的這許多教育方式，不是去研究他的打罵、教導的方法，而是要研究受教者的根機如何？像有的一畝田，可以長出五百斤的稻穀，但有的一畝田，卻只能長出二百斤，甚至只有一百斤，這就看地的資質、根機如何？",
        "印光大師云：「以念佛為最要緊。因為一個修道的佛教徒，不以求生西方為信願，則簡直自尋苦惱，喜隨三塗，好像很糊塗的樣子。」又云：「不念佛的人太苦，念佛求生淨土的法門，才是最直接最了當的。」",
        "六祖壇經 真自由與大自在皆持戒清淨而來，戒律實乃解脫之因，自在是持戒之果，只有真持戒才得真自由。",
        "普賢菩薩警眾偈云:「是日已過，命亦隨減如少水魚，斯有何樂?大眾當勤精進，如救頭然，但命無常，慎勿放逸!」生命一點一滴的流逝，誰都不知還有多少日子，如果死到臨頭才要精進，必定後悔莫及!",
        "起煩時，不要和這個說那個說，說來講去惹是非，最好多禮佛消業障解煩惱。",
        "別人沒有行的，做不到的，我們一定行得到，做得到 否則，批評別人，自己豈不也與他人同一類?",
        "凡事沒有絶對，有時因禍得福，有時反而樂極生悲，所以必定應明因果知進退。",
        "為人處事要「靜坐常思己過，閒談莫論人非」隨時檢討自己，不好的馬上改過，經常除去心中的垃圾、煩惱、無明等，讓自己的心淨，像一面鏡子，這即是「無念」的心，就是佛性，也是我們的真正的生命。",
        "放下緊繃的心，以柔軟心應對進退，可以轉變習氣與執著，突破種種障礙。",
        "念佛本是超生死，先須識得生死根，癡愛即是生死根，不拔癡愛難解脫。癡愛即是念佛心，即將念佛念癡愛，癡愛若能漸漸斷，心心彌陀全身現。即此便是真精進，不可一念便忘卻，淨土就在淨心中，不得向外別尋求。",
        "修行只有八個字，發菩提心、提起正念。提起什麼正念 — 觀照的正念，譬如：觀無常，觀不淨觀，修四念處，四聖諦，十二因緣，這些都是生滅的造作法。什麼是不生不滅的湼槃自性呢？如果不悟的話，就好比盲人摸象，講的頭頭是道，其實各執一端，未盡全貌。",
        "一念清淨好念佛，是非人我隨他去，生老病死無人替，做人做佛靠自己。",
        "對人真誠，才能擁有真實的情誼，對事以真才能成就萬事。",
        "人的一生中難免遭遇困難挫折，當下可能悲憤怨對，然而，當挺過之後，或許某個時刻，你會發現一切自有因緣，一切都是最好的安排。",
        "（六祖壇經）裡，惠能大師告訴我們，除人我，須彌倒；就是要去除人我的分別心，要把人我的執著去除；人我的執著就好像須彌山，障礙人際的和諧、溝通。人我一除，阻礙也就沒有了。",
        "古德大師說：「向前三步想一想，退後三步思一思；瞋心起時要思量，熄下怒火最吉祥。」",
        "懺悔業障，是生活的反省。眾生在日常生活裡，身、口、意三業經常造下難以彌補的過失，因此，需藉著懺悔來清淨身心。所以，生活中的反省懺悔是非常重要。",
        "「心安芧屋穩，性定菜根香」如果能將這念攀緣的心收回來，安住在自己的本心本性上，心自然能安、能靜。",
        "雖然戒以殺、道、淫妄為根本，但如在日常生活中，貪求飲食，貪樂睡眠，不能守護根門，不能自知所行，對物欲不滿足，對人事不遠離，那一定煩惱多、犯戒作惡。",
        "（十誦律）卷六十一偈云：若人不知罪不除，他為除罪便瞋恚，是名無智愚癡人，日日妄失功德利；譬如月十六日後，其光漸漸消滅盡。若有人知罪得除，他為除罪便歡喜，是名有智黠慧人，日日大得功德利；譬如月生一日後，其光漸漸轉增上。",
        "富貴的物質生活無法恆久，心靈充實，以德為心才是生命最大的財富。貧窮富裕一念間，身處貧困能安居樂業，享受自在的生活，才是富有，心靈富有的人胸襟磊落，懂得關心別人，同理和善，知足感恩最富有。",
        "「信願行」為淨土之網宗，是末世凡夫解脫六道生死輪迴之根本。（一）、攝心念佛：蓮池大師云：「句句出口入耳，聲聲喚醒自心。」持佛名號，攝耳諦聽，心自歸一。（二）、平時念佛：當宜於「信願一心」處著力。（三）、臨終念佛須知無始劫來的生死之路，全憑此時之一念心決定。當「一念融入阿彌念佛」。",
        "（佛說盂蘭盆）經言：「行孝慈者，皆應為所生現在父母、過去七世父母，於七月十五日，歡喜日，僧自恣日，以百味飲食安盂蘭盆中，施十方自恣僧，乞願便使現在父母，壽命百年無病，離餓鬼苦，得生天人中，福樂無極。」由此可知，參與盂蘭盆勝會，實是報父母恩之殊勝法門。",
        "古德：「說道在紅塵鬧市修，全憑五戒做根由。殺生戒除慈心大，不貪財物廉潔優，見色不貪生清淨，葷酒永斷性長流，欲學長舌莫妄語，成佛不須出世求。」",
        "慈心的涵養，不但化解了自身的、瞋毒之毒害，也利害了有情眾生，更是成就無上菩提的因地本行。",
        "古德常說：「真味只淡，至人是常」但是都能真正做到這淡和常？跟隨和尚修行，和尚最令人感受到不常的，應該是日用之中的平淡吧！",
        "「給」，對現世的世間有重大的貢獻； 「留」，對未來的人間有重大的意義。 我們不但要為現在施給，更要為未來留下一些什麼？ 我們應該要把歷史留在人間，我們要把信仰留在人間， 我們要把慈悲留在人間，我們要把貢獻留在人間， 我們要把智慧留在人間。 我們不是來人間消費的，我們不是來人間享受的； 我們要增添人間的彩色，我們要增添人間的動力， 我們要增添人間的歡喜，我們要增添人間的文化，做為大眾的模範。",
        "有人說，人死如燈滅，一死百了，哪有來生？還是迷的斷滅見。也有人說，人有來生，一顆種子，種到泥土裡，都會再開花結果，會有來生；人死以後，當然還會再來做人，不會改變 ─這也是迷的常見。說人死了以後沒有來生的斷見，和說人死了以後一定會做人的常見，都不是人生的真理，人死不是如燈滅，人死也不一定是做人，隨著業報因緣五趣流轉，六道輪迴行善的人間，天上行惡的地獄，惡鬼畜生，這才是真實的人生。",
        "念佛誠如蓮池大師所云： 「句句出入耳，聲聲喚醒自己。」念到一心中只有一句佛號，及淨土依正莊嚴。除此之外，不緣其他雜念。是故，念佛之要旨是「都攝六根念，淨念相繼念。」",
        "環境不會改變，解決之道在於改變自己。過錯是暫時的遺憾，錯過則是永遠遺憾。",
        "每個人每天都應該有一點屬於自己的生活，享受一下「寧靜」的人生意味。希望求得寧靜，首先要有淡泊的性格，不要一味地追求虛榮、戀慕繁華；從淡泊裡才能享有真正的寧靜。",
        "人一出生，就是一種責任，在世間上，無論你擁有高官厚爵，或享有榮華富貴，從佛法來看，都是一種責任，一種苦難。所謂「愛不重、不生娑婆；念不切，不生淨土」，眾生由於業力，來到人間承受苦難的業報，再怎麼健康，會有衰老的時侯，再怎樣富有，會有失去的一天；物質上再豐厚得意，內心不滿足，也不會感到幸福。因此如何彌補人間的苦難，在面對苦難的生死，而覺得不苦不難，能安然處之，生活泰然，就能超越苦難的生死。",
        "人我之間的相處，有時侯，一句話表逹得不好，就會產生磨擦，夫妻之間，朋友之間，部屬之間，若是責備太多，彼此也會有隔閡與疏離，這是做人處事的缺陷。所以我們要「以鼓勵代替責備，以讚美代替呵斥。」",
        "逆境未必是壞事，因為困頓，才更懂得珍惜擁有的一切。如果人生都是順途，又怎能看到人間百態。",
        
    ],
    getRandomTip: function () {
        var index = Math.floor(Math.random() * this.tips.length);
        return this.tips[index];
    }
};
